InformationRegisters/ПараметрыУчетаПоПодразделениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыУчетаПоПодразделениям</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвтоСозданиеВозвратаПокупателяПриВозвратепоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоСозданиеНалоговыхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоСозданиеПоступленияДенегПриПеремещении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоСозданиеПоступленияДенегПриРасходе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоСозданиеПриходнойНакладнойПриРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоУчетРозницаКасса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоУчетРозницы</Name>
					<Comment>уст. для филиала</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьСкидкаНаВес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьСкладВозвратов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьУчетЗатратПоОбъектам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КтоВыписываетНакладные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоСоставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПодразделенияДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасчетныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасчетныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогДефицитаВЗаказе</Name>
					<Comment>Порог дефицита в заказе в процентах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогПрофицитаВЗаказе</Name>
					<Comment>Порог профицита в заказе в процентах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначенияОбъектаЗатрат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипыЦен</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажиПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРозница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЦеновыеГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачалаПолученияАвтозаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартииТоваровВРознице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварыВРознице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнкассацияПоступлениеДенегВедомость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачалаЗагрузкиЗаявок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоУчетРозницыВедомость</Name>
					<Comment>уст. для филиала</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспределительныйЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьПроверкуСтандартаВЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретУдаленияСвязанныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьПроверкуОстатковПриОгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаниеНаценкиПоИнкассации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаниеТарыНаЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьПроверкуКратностиОтклоненияПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьПроверкуПустогоКоличестваПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыУчетаПоВидамНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыУчетаПоВидамНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыполнятьПроверкуКратностиОтклоненияПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КД_ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ДокументРасходнаяНакладнаяСервер/Ext/Module.bsl
Процедура ПроверитьОтклонениеПриОтгрузке(отказ, объект, имяТабличнойЧасти = "Запасы") Экспорт
	
	параметрыУчетаПодразделения = РегистрыСведений.ПараметрыУчетаПоПодразделениям.ПолучитьПараметрыУчетаПоПодразделению(объект.Дата, объект.Подразделение, Новый Структура("ВыполнятьПроверкуКратностиОтклоненияПриОтгрузке"));
	Если Не параметрыУчетаПодразделения.ВыполнятьПроверкуКратностиОтклоненияПриОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	табличнаяЧасть = объект[имяТабличнойЧасти];
	
	представлениеТабличнойЧасти = Метаданные.НайтиПоТипу(ТипЗнч(табличнаяЧасть)).Представление();
	
	Если табличнаяЧасть.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки,
	|	-ТабличнаяЧасть.КоличествоОтклонение КАК КоличествоОтклонение,
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ТабличнаяЧастьОбъекта
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧастьОбъекта.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧастьОбъекта.Номенклатура.БПАГКратностьУпаковки <= ТабличнаяЧастьОбъекта.КоличествоОтклонение
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроверкаОтклонения,
	|	ЕСТЬNULL(ПараметрыУчетаПоВидамНоменклатурыСрезПоследних.ВыполнятьПроверкуКратностиОтклоненияПриОтгрузке, ЛОЖЬ) КАК ВыполнятьПроверку
	|ИЗ
	|	ТабличнаяЧастьОбъекта КАК ТабличнаяЧастьОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоВидамНоменклатуры.СрезПоследних(&ДатаСреза, ) КАК ПараметрыУчетаПоВидамНоменклатурыСрезПоследних
	|		ПО ТабличнаяЧастьОбъекта.Номенклатура.КД_Вид = ПараметрыУчетаПоВидамНоменклатурыСрезПоследних.ВидНоменклатуры
	|ГДЕ
	|	ТабличнаяЧастьОбъекта.КоличествоОтклонение > 0
	|	И ВЫБОР
	|			КОГДА ТабличнаяЧастьОбъекта.Номенклатура.БПАГКратностьУпаковки <= ТабличнаяЧастьОбъекта.КоличествоОтклонение
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ЕСТЬNULL(ПараметрыУчетаПоВидамНоменклатурыСрезПоследних.ВыполнятьПроверкуКратностиОтклоненияПриОтгрузке, ЛОЖЬ)";
	
	#КонецОбласти
	
	
	запрос.УстановитьПараметр("ТабличнаяЧасть", табличнаяЧасть);
	запрос.УстановитьПараметр("ДатаСреза", объект.Дата);
	
	результатЗапроса = запрос.Выполнить();
	
	Если результатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	отказ = Истина;
	
	// Формируем список номеров строк.
	списокСтрок = "";
	
	выборка = результатЗапроса.Выбрать();
	Пока выборка.Следующий() Цикл
		
		// Если в списке уже есть номера строк, добавим запятую.
		Если Не ПустаяСтрока(списокСтрок) Тогда
			списокСтрок = списокСтрок + ", ";
		КонецЕсли;
		
		списокСтрок = списокСтрок + выборка.НомерСтроки;
		
	КонецЦикла;
	
	текстСообщения = "Обнаружена перетарка в строках.
	|Строки списка ""[ПредставлениеТабличнойЧасти]"": [СписокСтрок].";
	
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "[ПредставлениеТабличнойЧасти]", представлениеТабличнойЧасти);
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "[СписокСтрок]", списокСтрок);
	
	ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(Истина, текстСообщения, объект, имяТабличнойЧасти);
	
	
КонецПроцедуры
